/* Вывести информацию о книгах(автор, название, цена),
цена которых меньше самой большой из минимальных цен, вычисленных для каждого автора. */

SELECT author, title, price
FROM book
WHERE price < ANY
    (SELECT MIN(price)
    FROM book
    GROUP BY author)
;

/*
Query result:
+------------------+---------------+--------+
| author           | title         | price  |
+------------------+---------------+--------+
| Булгаков М.А.    | Белая гвардия | 540.50 |
| Достоевский Ф.М. | Идиот         | 460.00 |
| Достоевский Ф.М. | Игрок         | 480.50 |
+------------------+---------------+--------+
Affected rows: 3
*/