/* Придумайте один или несколько запросов к нашей таблице book, используя вложенные запросы. */

SELECT title, author, amount, price,
    (SELECT MIN(price)
     FROM book) AS Среднее_количество
FROM book
WHERE ABS(price - (SELECT MIN(price) FROM book)) > 200;

/*
Query result:
+--------------------+------------------+--------+--------+--------------------+
| title              | author           | amount | price  | Среднее_количество |
+--------------------+------------------+--------+--------+--------------------+
| Мастер и Маргарита | Булгаков М.А.    | 3      | 670.99 | 460.00             |
| Братья Карамазовы  | Достоевский Ф.М. | 3      | 799.01 | 460.00             |
+--------------------+------------------+--------+--------+--------------------+
Affected rows: 2
*/