package stepik.javabasics.languagebasics.taskscycles;

import java.util.Scanner;

public class Repeat10 {
    public static void main(String[] args) {
        String hi = "Привет";
        for (int i = 1; i <= 10; i++) {
            System.out.println(hi);
        }
    }
}

/*
Напишите программу, которая выводит на экран слово "Привет" (без кавычек) 10 раз.

Sample Input:

Sample Output:
Привет
Привет
Привет
Привет
Привет
Привет
Привет
Привет
Привет
Привет
 */