/* Придумайте один или несколько запросов к нашей таблице book, используя групповые функции. */

SELECT author,
    MIN(price) AS Минимальная_цена,
    MAX(price) AS Максимальная_цена,
    SUM(price*amount) AS Общая_стоимость,
    SUM(amount) AS Количество_книг
FROM book
GROUP BY author
HAVING SUM(amount) > 5
ORDER BY Количество_книг DESC;

/*
Query result:
+------------------+------------------+-------------------+-----------------+-----------------+
| author           | Минимальная_цена | Максимальная_цена | Общая_стоимость | Количество_книг |
+------------------+------------------+-------------------+-----------------+-----------------+
| Достоевский Ф.М. | 460.00           | 799.01            | 11802.03        | 23              |
| Есенин С.А.      | 650.00           | 650.00            | 9750.00         | 15              |
| Булгаков М.А.    | 540.50           | 670.99            | 4715.47         | 8               |
+------------------+------------------+-------------------+-----------------+-----------------+
Affected rows: 3
*/