/* Для каждого автора вычислить суммарную стоимость книг S (имя столбца Стоимость),
а также вычислить налог на добавленную стоимость  для полученных сумм (имя столбца НДС ),
который включен в стоимость и составляет k = 18%, а также стоимость книг (Стоимость_без_НДС) без него.
Значения округлить до двух знаков после запятой. */

SELECT author, ROUND(SUM(amount*price),2) AS Стоимость,
    ROUND((SUM(amount*price)*18/100)/(1+18/100),2) AS НДС,
    ROUND(SUM(amount*price)/(1+18/100),2) AS Стоимость_без_НДС
FROM book
GROUP BY author;

/*
Query result:
+------------------+-----------+---------+-------------------+
| author           | Стоимость | НДС     | Стоимость_без_НДС |
+------------------+-----------+---------+-------------------+
| Булгаков М.А.    | 4715.47   | 719.31  | 3996.16           |
| Достоевский Ф.М. | 11802.03  | 1800.31 | 10001.72          |
| Есенин С.А.      | 9750.00   | 1487.29 | 8262.71           |
+------------------+-----------+---------+-------------------+
Affected rows: 3
*/