/* Вывести образовательные программы, на которые для поступления необходим предмет «Информатика».
Программы отсортировать в обратном алфавитном порядке. */

SELECT name_program
FROM program JOIN program_subject USING(program_id)
JOIN subject USING(subject_id)
WHERE name_subject = 'Информатика'
ORDER BY 1 DESC;

/*
Query result:
+-------------------------------------+
| name_program                        |
+-------------------------------------+
| Прикладная математика и информатика |
| Математика и компьютерные науки     |
+-------------------------------------+
Affected rows: 2
*/
