/* Придумайте один или несколько запросов к нашей таблице book. Проверьте, правильно ли они работают. */

SELECT title, author, price,
ROUND(IF(amount<2, price*0.1, IF(amount<5, price*0.5, price*0.85)), 2) AS sale
FROM book
WHERE (title LIKE "_%и%" OR author LIKE "%А.%") AND (price BETWEEN 600 AND 700)
ORDER BY 4 ASC;

/*
Query result:
+-----------------------+---------------+--------+--------+
| title                 | author        | price  | sale   |
+-----------------------+---------------+--------+--------+
| Мастер и Маргарита    | Булгаков М.А. | 670.99 | 335.50 |
| Стихотворения и поэмы | Есенин С.А.   | 650.00 | 552.50 |
+-----------------------+---------------+--------+--------+
Affected rows: 2
*/