/*
Выведите в качестве результата одного запроса общее количество заказов,
сумму стоимостей (бюджетов) всех проектов, средний срок исполнения заказа в днях.
*/

SELECT COUNT(project_name),
    SUM(budget),
    AVG(DATEDIFF(project_finish, project_start))
FROM project;

/*
Query result:
+---------------------+-------------+----------------------------------------------+
| COUNT(project_name) | SUM(budget) | AVG(DATEDIFF(project_finish, project_start)) |
+---------------------+-------------+----------------------------------------------+
| 100                 | 50746251.00 | 171.9300                                     |
+---------------------+-------------+----------------------------------------------+
Affected rows: 1
*/