/*
Выведите 5 категорий товаров, продажи которых принесли наибольшую выручку.
Под выручкой понимается сумма произведений стоимости товара на количество проданных единиц.
Результат должен содержать два столбца:
название категории,
выручка от продажи товаров в данной категории.
*/

SELECT
	category,
    SUM(price*sold_num) AS revenue
FROM store
GROUP BY category
ORDER BY revenue DESC
LIMIT 5;

/*
Query result:
+----------------+----------+
| category       | revenue  |
+----------------+----------+
| Air Fresheners | 67816.00 |
| Snacks         | 59991.00 |
| Cakes          | 54172.00 |
| Water          | 53860.00 |
| Tea & Coffee   | 52868.00 |
+----------------+----------+
Affected rows: 5
*/