/* Придумайте один или несколько запросов на выборку для предметной области «Тестирование». */

SELECT CONCAT(LEFT(name_question, 30), '...') AS Вопрос, name_answer, (IF(name_answer = is_correct,'Неверно','Верно')) AS Результат
FROM question
JOIN answer USING(question_id)
JOIN testing USING(answer_id)
WHERE attempt_id = 5
LIMIT 2;

/*
Query result:
+-----------------------------------+-------------+-----------+
| Вопрос                            | name_answer | Результат |
+-----------------------------------+-------------+-----------+
| Условие, по которому отбираютс... | WHERE       | Верно     |
| Запрос на выборку начинается с... | SELECT      | Верно     |
+-----------------------------------+-------------+-----------+
Affected rows: 2
*/